{
  "overview": "Martin Express Rail Overview The Martin Express Rail is Summit City's flagship commuter artery—engineered for velocity, precision, and place-based storytelling. Designed with long-distance travelers, professionals, and cultural explorers in mind, it connects the metropolitan core with its most vital civic and innovation zones.\n- From skyline to soil, the line offers express service between Central Station, the city's monumental transfer hub, and the greater Summit region, with seamless links to all four Light Rail lines (Red, Blue, Green, Yellow).\n- Begin your journey in the Financial District at The Ledger Gate, a kinetic atrium station enveloped in civic poetry and market pulse—your direct line into Summit’s economic engine.\n- Transfer easily to the Convention Center Station, where hospitality and transit converge beneath soaring glass pavilions shared by two landmark hotels: Grand Pinnacle Summit and boutique Crescendo Suites.\n- Just beyond, Gateway Plaza Station brings color and cadence with food halls, art walks, and quick strolls to the riverfront promenade. A cultural stopover teeming with life and express bus 960 links to the western suburbs.\n- For suburban connectivity, the rail links to SubHub Station, Summit’s premier park-and-ride interchange set in Commons Ridge—home to family-friendly walkways and community-square urbanism.\n- Heading north, Northern Spire Station bridges residential elegance with natural overlook trails, connecting Skybend Ridge’s hillside homes to the greater network.\n- Anchoring the line’s northern cap is Terminus North, The Convergence Spire, a multimodal innovation node offering regional transfers to tech campuses and research labs in Northpoint.\n- Rounding out the southern corridor, Airport Hotel & Tech Park Station welcomes travelers into a next-gen hospitality zone of modular lodging suites, AI-synced rest pods, and conference-ready green commons.\nWith its high-speed intervals, minimalist stops, and comfort-optimized interiors, the Martin Express Rail is more than a commute—it’s Summit’s moving backbone, shaping everything from commerce to community rhythm."
}